In [24]:
import pandas as pd
import numpy as np

In [2]:
##Vamos a importar el archivo correcto
df = pd.read_csv('tidy_sample.csv', sep=';')

In [3]:
df.head()

     nombre  emp1  emp2
0     Jorge    23     5
1    Camila    12    10
2    Erison    54     2
3      Luis    12     1
4  Victoria    11    23

In [6]:
#Columns represent separate variables
# Rows represent individual observations
# Observational units form tables

##Columnas representan variables separaas
# filas representan observaciones individuales
## Unidades de observacion en forma de tabla

#Better for reporting vs. be!er for analysis
#Tidy data makes it easier to fix common data problems

In [7]:
#The data problem we are trying to fix:
# Columns containing values, instead of variables
# Solution: pd.melt()

In [10]:
pd.melt(frame=df, id_vars='nombre',value_vars=['emp1', 'emp2'])

      nombre variable  value
0      Jorge     emp1     23
1     Camila     emp1     12
2     Erison     emp1     54
3       Luis     emp1     12
4   Victoria     emp1     11
5      Cesar     emp1     10
6      Jorge     emp2      5
7     Camila     emp2     10
8     Erison     emp2      2
9       Luis     emp2      1
10  Victoria     emp2     23
11     Cesar     emp2     32

In [11]:
pd.melt(frame=df, id_vars='nombre',value_vars=['emp1', 'emp2'],
       var_name='empresa', value_name='result')

      nombre empresa  result
0      Jorge    emp1      23
1     Camila    emp1      12
2     Erison    emp1      54
3       Luis    emp1      12
4   Victoria    emp1      11
5      Cesar    emp1      10
6      Jorge    emp2       5
7     Camila    emp2      10
8     Erison    emp2       2
9       Luis    emp2       1
10  Victoria    emp2      23
11     Cesar    emp2      32

In [12]:
##Pivot: un-melting data
#Opposite of melting
# In melting, we turned columns into rows
# Pivoting: turn unique values into separate columns
# Analysis friendly shape to reporting friendly shape
# Violates tidy data principle: rows contain observations
# Multiple variables stored in the same column

In [15]:
##Vamos a importar el archivo correcto
df2 = pd.read_csv('wather_tidy.csv', sep=';')

In [17]:
df2

        fecha elemento  valor
0  30/01/2019     tmin   32.5
1  30/01/2019     tmax   23.4
2   1/02/2019     tmin   12.3
3   1/02/2019     tmax   54.2
4   2/02/2019     tmin   11.3
5   2/02/2019     tmax   13.6
6   9/02/2019     tmin   13.1
7   9/02/2019     tmax    9.2

In [20]:
weather_tidy = df2.pivot( index='fecha', columns='elemento', values='valor')

In [21]:
print(weather_tidy)

elemento    tmax  tmin
fecha
1/02/2019   54.2  12.3
2/02/2019   13.6  11.3
30/01/2019  23.4  32.5
9/02/2019    9.2  13.1

In [ ]:
##Que pasa cuando es duplicado el valor tmin
##Tiene un parámetro que especifica cómo tratar con duplicado valores
##Ejemplo: puede agregar los valores duplicados tomando sus promedio

In [25]:
weather2_tidy = df2.pivot_table(values='valor', index='fecha', columns='elemento', aggfunc=np.mean)

In [26]:
print(weather2_tidy)

elemento    tmax  tmin
fecha
1/02/2019   54.2  12.3
2/02/2019   13.6  11.3
30/01/2019  23.4  32.5
9/02/2019    9.2  13.1

In [ ]:
##Beyond melt and pivot
##Otro problema tipico, las columnas contienen multiplos bits de información

In [ ]:
##Nothing inherently wrong about original data shape
## Not conducive for analysis

In [43]:
df = pd.read_csv('tuburculosis.csv', sep=',')
df

  country  year  m014  m1524
0      AD  2000     0      0
1      AE  2000     2      4
2      AF  2000    52    228

In [44]:
result=pd.melt(frame=df, id_vars=['country', 'year'])

In [48]:
result

  country  year variable  value
0      AD  2000     m014      0
1      AE  2000     m014      2
2      AF  2000     m014     52
3      AD  2000    m1524      0
4      AE  2000    m1524      4
5      AF  2000    m1524    228

In [45]:
print(result)

  country  year variable  value
0      AD  2000     m014      0
1      AE  2000     m014      2
2      AF  2000     m014     52
3      AD  2000    m1524      0
4      AE  2000    m1524      4
5      AF  2000    m1524    228

In [49]:
##split del valor variable para determinar el sexo
result['sex']= result.variable.str[0]

In [50]:
result

  country  year variable  value sex
0      AD  2000     m014      0   m
1      AE  2000     m014      2   m
2      AF  2000     m014     52   m
3      AD  2000    m1524      0   m
4      AE  2000    m1524      4   m
5      AF  2000    m1524    228   m